tutorials/heatTransfer/heatTransportFoam/Bentheimer/constant/transportProperties2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

diffusionModel harmonic;

kappaf kappa_f;
kappas kappa_s;

gammaf gamma_f;
gammas gamma_s;

rhof rho_f;
rhos rho_s;


// ************************************************************************* //
